import { LOCALES } from '../constants';

const translations = {
  [LOCALES.UKRAINIAN]: {
    'header.buy': 'КУПИТИ',
    'header.blog': 'БЛОГ',
    'header.about': 'ПРО НАС',
    'header.contacts': 'КОНТАКТИ',
    'header.submenu1': 'Категорія номер один',
    'header.submenu2': 'Квартири в Дубаї',
    'header.submenu3': 'Категорія номер п\'ять',
    'button.consultation': 'Отримати консультацію',
    'Home.slider.1': 'Ласкаво просимо до мрії ',
    'Home.slider.2': 'Відкрийте для себе будинок мрії',
    'Home.slider.3': 'Відчуйте розкішне життя',
    'Home.welcome': 'Ласкаво просимо',
    'Home.to': 'До',
    'Home.luxury': 'Розкоші',
    'popup.title': 'Залиште свої контакти',
    'popup.subtitle': 'Ми зв\'яжемося з вами протягом трьох годин',
    'popup.sendButton': 'Надіслати',
    'popup.namePlaceholder': 'Ваше ім\'я *',
    'popup.telPlaceholder': 'Телефон *',

    'projects.title': 'Останні проекти',
    'projects.all': 'Всі',
    'projects.building': 'Будівництво',
    'projects.interior': 'Інтер\'єр',
    'projects.viewAll': 'Переглянути всі проекти',
    'projects.card.title': 'Дубай',
    'projects.card.description': `Проект в Дубаї - це розкішне місце з неперевершеним архітектурним дизайном та сучасними зручностями. 
                              Розташований в престижному районі, він пропонує розкішне проживання та неймовірні види на місто. 
                              Завітайте і переконайтеся самі!`,
    'projects.card.button': 'Переглянути проект',
    'expertise.quote.subtitle': 'Наша експертиза',
    'expertise.quote.title':
      '«Найкраща квартира в Дубаї», ми знайдемо вашу мрію',
    'expertise.quote.content': `Купуйте свою омріяну квартиру в найроскошнішому місті світу - Дубаї. 
                                Насолоджуйтесь величчю хмарочосів, блиском океану, розкішними курортами, 
                                теплим кліматом та безліччю можливостей.Наші квартири - це синтез стилю і сучасного комфорту. 
                                Ви знайдете ідеальне житло з різноманітними плануваннями та дизайнами, що відповідають вашим бажанням та потребам. 
                                Прокидайтесь кожного ранку з чарівним видом на переливаючіть відтінки блакиті Перської затоки, сидячи на балконі зі своєю улюбленою кавою. 
                                Купуючи квартиру, ви отримуєте не тільки прекрасне житло, а й доступ до басейну, фітнес-центру та консьєрж-сервісу, який задовольняє всі ваші потреби. 
                                Покупка квартири в Дубаї - це можливість зануритися у багату культуру, смаки різноманітної кухні та розкішний спосіб життя. Місто пропонує безліч розваг, 
                                від шопінгу в престижних бутіках до відпочинку на пісчаних пляжах та яскравих нічних клубах. Не пропустіть свій шанс придбати мрійову квартиру в Дубаї. 
                                Наша команда експертів допоможе зробити процес купівлі простим та безпечним. Зробіть крок до розкоші та стабільності. 
                                Зверніться до нас вже сьогодні та здійсніть свої мрії разом з нами. Дубай чекає на вас. Ваша омріяна квартира вже чекає тут.`,
    'quote.content': `«Не обмежуйте себе. Багато людей обмежують себе тим, що вони вважають, що можуть зробити. 
                      Ви можете досягти таких висот, які дозволить ваш розум. Пам/'ятайте, ви можете досягти того, у що вірите.»`,
    'quote.author': 'Мері Кей Еш',
    examples: `Власні апартаменти в Дубаї - це справжня мрія, яку ми допоможемо вам здійснити!
                  Наша компанія пропонує неперевершений вибір розкішних апартаментів, розташованих у
                  найпрестижніших районах Дубаю.Купуючи наші апартаменти, ви отримуєте не тільки
                  розкішне житло, але й величезний спектр переваг, які забезпечать вам комфорт,
                  релаксацію і задоволення на кожному кроці.
                  Наші апартаменти відрізняються неперевершеною якістю і дизайном.Ви будете
                  захоплені шикарними інтер'єрами, високоякісними матеріалами та сучасними
                  технологіями.Кожен детально продуманий простір створений з метою забезпечити
                  вам незабутні враження і задоволення від проживання.
                  Наші апартаменти також радують розкішними видами на місто та океан.Відкрийте
                  вікна і насолоджуйтесь захоплюючими панорамними краєвидами, які заворожують своєю
                  красою і розмаїттям.Кожен день ви будете прокидаєтесь з чарівними видами, які
                  надихнуть вас на нові досягнення і досягнення в житті.
                  Крім того, наші апартаменти знаходяться у найзручніших місцях, недалеко від
                  найпопулярніших ресторанів, магазинів, розважальних закладів і пляжів.Ви будете
                  мати безліч можливостей для веселощів, шопінгу та культурних вражень, не виходячи
                  зі свого житла.
                  Купуйте апартаменти мрії в Дубаї вже сьогодні і перетворіть своє життя на справжню
                  казку.Звертайтеся до нас зараз і наші професіонали з радістю допоможуть вам
                  знайти ідеальні апартаменти, що відповідають вашим найвищим очікуванням.`,

    'form.question': 'У вас є запитання?',
    'form.contactUs': 'Зв\'яжіться з нами',
    'form.emailLabel': 'Електронна пошта',
    'form.emailPlaceholder': 'Електронна пошта *',
    'form.sendButton': 'Надіслати',
    'form.emailError': 'Неправильний формат електронної пошти',
    'form.emailRequired': 'Поле електронної пошти є обов\'язковим',

    'home.arcticleTitle': 'Корисні статті',
    'home.arcticleLink': 'Дивитись всі статті',
    'articles.date': '03 липня 2022',
    'articles.title': 'Відкрийте для себе архітектуру',
    'articles.description':
      'Проекти для багатьох великих вітчизняних та іноземних корпорацій, підприємств у багатьох галузях',
    'articles.link': 'Дізнатися більше',

    'reviews.personName1': 'Пол',
    'reviews.personPosition1': 'Власник',
    'reviews.personCompany1': 'Paul.com.',
    'reviews.personQuotes1':
      'Проекти для багатьох великих вітчизняних і зарубіжних корпорацій, підприємств у багатьох галузях, таких як фінанси, банківська справа, ресторанне господарство, освіта, зв\'язок.',

    'reviews.personName2': 'Роберт',
    'reviews.personPosition2': 'Засновник ',
    'reviews.personCompany2': 'Apple inc.',
    'reviews.personQuotes2':
      'Заснована у 2007 році, Sparch спеціалізується на наданні інноваційних послуг, таких як дизайн веб-сайтів, фірмовий стиль та маркетинг.',
    'faq.title': 'Запитання та відповіді',
    'question.1':
      'Найбільша і найдавніша сторінка з цитатами в Інтернеті з приблизно 30 категоріями',
    'answer.1':
      'Sed in sem pellentesque, eleifend erat vitae, tincidunt turpis. Pellentesque augue elit, rutrum sit amet commodo vel, porta quis purus.',
    'question.2':
      'Велика колекція натхненних цитат, думки найвеличезніших розумів в історії',
    'answer.2':
      'Sed in sem pellentesque, eleifend erat vitae, tincidunt turpis. Pellentesque augue elit, rutrum sit amet commodo vel, porta quis purus.',
    'question.3': 'Цитати з великих творів літератури',
    'answer.3':
      'Веб-сайт книжкового клубу є чудовим ресурсом для любителів літератури, пропонуючи відібрану підбірку цитат з великих творів літератури.',
    'question.4': 'Читайте цитати та вислови відомих людей в історії',
    'answer.4':
      'Якщо ви шанувальник історії, вам сподобається цей веб-сайт, який дозволяє читати цитати та вислови деяких з найвідоміших людей в історії.',
    'question.5': 'Зібрані цитати Альберта Ейнштейна',
    'answer.5':
      'Цей веб-сайт є обов\'язковим для відвідування для всіх, хто цікавиться ідеями Альберта Ейнштейна, і містить колекцію його найбільш проникливих і задумливих цитат.',

    'footer.buy': 'Купити',
    'footer.buy.submenu1': 'Квартира в Дубаї',
    'footer.buy.submenu2': 'Будинок в Дубаї',
    'footer.buy.submenu3': 'Апартаменти в Дубаї',
    'footer.buy.submenu4': 'Лофт в Дубаї',
    'footer.buy.submenu5': 'Пентхаус в Дубаї',
    'footer.buy.submenu6': 'Вілла в Дубаї',

    'footer.services': 'Послуги',
    'footer.services.submenu1': 'Управління нерухомістю в Дубаї, ОАЕ',
    'footer.services.submenu2': 'Продаж нерухомості в Дубаї, ОАЕ',
    'footer.services.submenu3': 'Оренда нерухомості в Дубаї, ОАЕ',
    'footer.services.submenu4': 'Інвестиції в Дубаї, ОАЕ',
    'footer.services.submenu5': 'Нерухомість за криптовалюту в Дубаї',
    'footer.services.submenu6': 'Переїзд до Дубаї, ОАЕ',

    'footer.inform': 'Інформація',
    'footer.inform.submenu1': 'Відео',
    'footer.inform.submenu2': 'Подкасти',
    'footer.inform.submenu3': 'Закони',
    'footer.inform.submenu4': 'Питання та відповіді',
    'footer.inform.submenu5': 'Книги',
    'footer.inform.submenu6': 'Статті',
    'footer.about': 'Про компанію',
    'footer.about.submenu1': 'Вакансії',
    'footer.about.submenu2': 'Історія',
    'footer.about.submenu3': 'Ліцензії',
    'footer.about.submenu4': 'Чому ми',
    'footer.about.submenu5': 'Агентство нерухомості',
    'footer.contacts': 'Контакт',
    'footer.contacts.address': '964 Worthington Drive\nДубай, ОАЕ',

    'contact.form.subtitle': 'Ми завжди',
    'contact.form.subtitle.accent': 'на зв\'язку',
  },
};

export default translations;
