// const express = require('express');
// const app = express();
// // const path = require('path');


// // Обработка главной страницы на английском языке
// app.get('/', (req, res) => {
//   res.redirect('/en');
// });


// // Обработка главной страницы на украинском языке
// app.get('/ua', (req, res) => {
//   // Здесь вы можете отобразить главную страницу на украинском языке
// });

// // Обработка страницы контактов на английском языке
// app.get('/en/contacts', (req, res) => {
//   // Здесь вы можете отобразить страницу контактов на английском языке
// });

// // Обработка страницы контактов на украинском языке
// app.get('/ua/contacts', (req, res) => {
//   // Здесь вы можете отобразить страницу контактов на украинском языке
// });

// // Другие маршруты и обработка запросов

// // Обработка несуществующих маршрутов
// app.use((req, res, next) => {
//   res.status(404).send('Страница не найдена');
// });

// // Запуск сервера
// const port = process.env.PORT || 3001;
// app.listen(port, () => {
//   console.log(`Server started on http://localhost:${port}`);
// });
